trung-pham-dinh/nRF24L01-on-C8051/user/src/main.c
#include "compiler_defs.h"
#include "C8051F930_defs.h"
#include "peripherals.h"
#include "spi.h"
#include "nRF24L01.h"

uint8_t write_addr[] = {0x01,0x01,0x01,0x01,0x01};
uint8_t read_addr[]  = {0x02,0x02,0x02,0x02,0x02};
uint32_t count = 0;
sbit nrf_led = P0^0;

const unsigned char low_reload = LOW_RELOAD_0;
const unsigned char high_reload = HIGH_RELOAD_0;
#pragma OT(1)
void TIMER_ISR() interrupt INTERRUPT_TIMER0 {

	nRF_timer_run();
	
	TL0 = low_reload;
  TH0 = high_reload;
}

extern void nRF_delay_us(unsigned int us);
extern uint8_t nRF_flush_rx(void);

void main() {
	PCA0MD = 0;	// watchdog disable
	Init_Device();
	P1=P0=0x00;
	
	nRF_begin();
	nRF_setWritingPipe(write_addr);
	nRF_setReadingPipe(read_addr, 32, 0);
	nRF_startListening();
	while(1) {
		nRF_delay_us(5000);
		if(nRF_available(0)) {
			count++;
			nrf_led^=1;
			nRF_flush_rx();
		}
	}
}

